#Вариант 1
#Дан символ С. Вывести его код (то есть номер в кодовой таблице).
C = input("Введите символ: ")
print("Код символа", C, ":", ord(C))