#Вариант 1
#Дано целое число A. Проверить истинность высказывания: «Число A является положительным».

a = int(input("Введите целое число: "))
if a > 0:
    print("Число a является положительным")
else:
    print("Число a не является положительным")
